# Stage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProgressChangedEventArgs..::..Stage Property
ProgressChangedEventArgs Class See Also
---
The current stage of the progress bar
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ProgressStage Stage { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Stage As ProgressStage
	Get
```

Visual C++
---
```text
public:
property ProgressStage Stage {
	ProgressStage get ();
}
```

# See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace